[["Heritage Center Announces Upcoming Live(stream) with Heritage Center Episodes","Sep 2, 2020","University of Dubuque Heritage Center is excited to announce the next four episodes of its Live(stream) with Heritage Center series. Held this fall, the series is an opportunity for viewers to meet the artists behind the music through Heritage Center’s social media."],["Bisignano Art Gallery Reopens with “Art During the Pandemic”","Sep 1, 2020","University of Dubuque’s Bisignano Art Gallery has reopened with its first exhibit of the season titled “Art During the Pandemic.”"],["Spartans of UD: Daphney Gabriel","Aug 25, 2020","Spartans of UD highlights what makes University of Dubuque special – the people who live, work, and study on campus."],["The Landscape of Guitar to Join Live(stream) with Heritage Center","Aug 14, 2020","University of Dubuque Heritage Center will continue its new Live(stream) with Heritage Center series this month with The Landscape of Guitar: The Animated Painting Concert Experience at noon Monday, Aug. 17 on the Heritage Center Facebook page."],["University of Dubuque’s Custom-Crafted Pipe Organ Installation Underway","Aug 4, 2020","The months-long process of installing University of Dubuque’s custom-crafted pipe organ is underway in Heritage Center’s John and Alice Butler Hall."],["Opening Convocation- Virtual","Sep 10, 2020 |\n\t\t10:45 AM \n\t\t\n\t\t| Virtual Viewing","Opening Convocation is a unique opportunity for the entire UD campus to honor our Christian commitment, the diversity of our community, and the pursuit of academic excellence.  All members of the University community are invited to watch this important event that celebrates the beginning of the new school year."],["Kennedy's Kitchen! A favorite local Irish Band, comprised of a family of lads and Heritage Center's very own Liam Ladewski, Kennedy's Kitchen will join Heritage Center live to celebrate \"Halfway to St. Patty's Day!\"","Sep 17, 2020 |\n\t\t7:30 PM \n\t\t\n\t\t| Streaming live on Facebook, and now Twitter and YouTube as well - just search @HeritageCTR or, on YouTube,  @UDBQMedia. Give them a follow to see exclusive live stream content, and updates on all things Heritage Center!","Special September live stream! Heritage Center hosts an interactive series called Live(stream) with Heritage Center. Each month the staff of the University of Dubuque's performing arts center feature special guest artists for live music, discussion, and updates. The month of September will bring an especially exciting broadcast, as they'll be hosting Kennedy's Kitchen! A favorite local Irish Band, comprised of a family of lads and Heritage Center's very own Liam Ladewski, Kennedy's Kitchen will join Heritage Center live to celebrate \"Halfway to St. Patty's Day!\" This broadcast will feature the band's music, a look into their lives, and plans for future local performances. Tune in Thursday, September 17th, 2020 at 7:30 p.m. for quite the craic! Streaming live on Facebook, and now Twitter and YouTube as well - just search @HeritageCTR or, on YouTube,  @UDBQMedia. Give them a follow to see exclusive live stream content, and updates on all things Heritage Center!"],["Alpin Hong- Fine-Tuned Pianist","Oct 22, 2020 |\n\t\t7:30 PM \n\t\t\n\t\t| Tune in Thursday, October 22nd, 2020 at 7:30 p.m. by searching @HeritageCTR on Facebook and Twitter, and @UDBQMedia on YouTube. Give us a follow to see more exclusive live stream content, and updates on all things Heritage Center! Visit dbq.edu/heritagecen","This month's Live stream with Heritage Center will feature special guest Alpin Hong! As a famed and fine-tuned pianist, Alpin Hong has made a career sharing his combination of stunning technique, emotional range, and rare humor around the world on stages such as Walt Disney Hall, the White House, and - you guessed it - the Heritage Center! In this broadcast, Heritage Center's team will interview Hong and stream an exclusive, live showcase performance. Get an inside perspective on this incredible artist and keep up with news about shows at Heritage Center, all while enjoying the precision and splendor of Hong's music. Tune in Thursday, October 22nd, 2020 at 7:30 p.m. by searching @HeritageCTR on Facebook and Twitter, and @UDBQMedia on YouTube. Give us a follow to see more exclusive live stream content, and updates on all things Heritage Center! Visit dbq.edu/heritagecenter and alpinhong.com to learn more"],["Darryl Van Leer of The Norm of Greatness","Nov 19, 2020 |\n\t\t7:30 PM \n\t\t\n\t\t| View the stream live on Facebook, Twitter, by searching @HeritageCTR or, @UDBQMedia on YouTube. Make sure to follow Heritage center for continued updates and exclusive live stream content. Learn more by visiting dbq.edu/hereitagectr and darrylvanleer.com.","The time of year has come for us to come together, reflect, and to be thankful. We are certainly thankful for each of our patrons, team members, and friends here at Heritage Center. This month, in our special Live stream with Heritage Center series, we will feature long anticipated guest Darryl Van Leer of The Norm of Greatness. Due to continuously challenging circumstances, we have all had to adjust our trajectory. So, while his live performance at Heritage Center is pending, Van Leer will join us in a timely live stream to share a preview of his show and some insight about himself, the art, and tributes he creates. Take an hour to gather and be grateful with us in the best way that we can right now, Thursday, November 19, 2020 at 7:30 p.m. View the stream live on Facebook, Twitter, by searching @HeritageCTR or, @UDBQMedia on YouTube. Make sure to follow Heritage center for continued updates and exclusive live stream content. Learn more by visiting dbq.edu/hereitagectr and darrylvanleer.com."],["Patrick Dewane's production, The Accidental Hero","Dec 17, 2020 |\n\t\t7:30 PM \n\t\t\n\t\t| Streaming live on Facebook and Twitter @HeritageCTR, and YouTube @UDBQMedia, on Thursday, December 17th, 2020 at 7:30 p.m. Give us a follow to keep up with 2021-2022 season announcements. Visit dbq.edu/heritagectr and accidentalhero.net to learn more!","2020 is ending, some might exclaim, \"At last!\" Regardless, with prospects that the new year will bring positive news and great strides along with it, Live(stream) with Heritage Center will feature another highly anticipated guest, expected to bring us to live excerpts from a sequel to Patrick Dewane's production, The Accidental Hero. Patrick's show appeared at Heritage Center in Fall 2017 while this live stream will focus on a new WWII story set at Christmastime. This live stream will also feature an in-depth interview with Mr. Dewane. Until then, tune in and get some background information on this incredibly thrilling story and family history. Streaming live on Facebook and Twitter @HeritageCTR, and YouTube @UDBQMedia, on Thursday, December 17th, 2020 at 7:30 p.m. Give us a follow to keep up with 2021-2022 season announcements. Visit dbq.edu/heritagectr and accidentalhero.net to learn more!"]]